## Plan Result (prod_landing)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 30 to add, 4 to change, 7 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].azurerm_monitor_diagnostic_setting.runtimes_datafactory
  * module.data_landing_zone[&#34;00&#34;].azurerm_monitor_diagnostic_setting.shared_integration_datafactory
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;external&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;landing&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;raw&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;external&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;landing&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;raw&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest00landingprod&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest00-meta002-prod&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest00-meta002-prod&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;landing-dfs&#34;]
* Update
  * module.logic[&#34;00&#34;].azurerm_resource_group_template_deployment.sqlConn
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].azurerm_windows_virtual_machine.winvm[0]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_virtual_machine_scale_set_extension.shir_install
* Delete
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.datafactory_storage[&#34;curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.datafactory_storage[&#34;raw&#34;]
* Replace
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].azurerm_monitor_diagnostic_setting.runtimes_datafactory will be created
  + resource "azurerm_monitor_diagnostic_setting" "runtimes_datafactory" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.OperationalInsights/workspaces/ingest00-logAnalytics001-prod"
      + name                           = "runtimes-datafactory-diag"
      + target_resource_id             = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.DataFactory/factories/ingest00-runtimes-dataFactory001-prod"

      + enabled_log {
          + category_group = "allLogs"
            # (1 unchanged attribute hidden)
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.data_landing_zone["00"].azurerm_monitor_diagnostic_setting.shared_integration_datafactory will be created
  + resource "azurerm_monitor_diagnostic_setting" "shared_integration_datafactory" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.OperationalInsights/workspaces/ingest00-logAnalytics001-prod"
      + name                           = "shared-integration-datafactory-diag"
      + target_resource_id             = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-prod"

      + enabled_log {
          + category_group = "allLogs"
            # (1 unchanged attribute hidden)
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.datafactory_storage["curated"] will be destroyed
  # (because azurerm_role_assignment.datafactory_storage is not in configuration)
  - resource "azurerm_role_assignment" "datafactory_storage" {
      - id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00curatedprod/providers/Microsoft.Authorization/roleAssignments/2ffc937c-1060-faeb-bce0-58e576700899" -> null
      - name                                   = "2ffc937c-1060-faeb-bce0-58e576700899" -> null
      - principal_id                           = "5db1b6eb-6169-4d2f-84fb-fa18081d0a5c" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> null
      - role_definition_name                   = "Storage Blob Data Contributor" -> null
      - scope                                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00curatedprod" -> null
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.datafactory_storage["raw"] will be destroyed
  # (because azurerm_role_assignment.datafactory_storage is not in configuration)
  - resource "azurerm_role_assignment" "datafactory_storage" {
      - id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00rawprod/providers/Microsoft.Authorization/roleAssignments/0acebb19-a42f-a385-144c-cbba93ecedf1" -> null
      - name                                   = "0acebb19-a42f-a385-144c-cbba93ecedf1" -> null
      - principal_id                           = "5db1b6eb-6169-4d2f-84fb-fa18081d0a5c" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> null
      - role_definition_name                   = "Storage Blob Data Contributor" -> null
      - scope                                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00rawprod" -> null
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.runtimes_datafactory_storage["curated"] will be created
  + resource "azurerm_role_assignment" "runtimes_datafactory_storage" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4bf62933-e968-47c7-b707-fde4567a2ca2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00curatedprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.runtimes_datafactory_storage["external"] will be created
  + resource "azurerm_role_assignment" "runtimes_datafactory_storage" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4bf62933-e968-47c7-b707-fde4567a2ca2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00externalprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.runtimes_datafactory_storage["landing"] will be created
  + resource "azurerm_role_assignment" "runtimes_datafactory_storage" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4bf62933-e968-47c7-b707-fde4567a2ca2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00landingprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.runtimes_datafactory_storage["raw"] will be created
  + resource "azurerm_role_assignment" "runtimes_datafactory_storage" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4bf62933-e968-47c7-b707-fde4567a2ca2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00rawprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.runtimes_datafactory_storage["workspace"] will be created
  + resource "azurerm_role_assignment" "runtimes_datafactory_storage" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4bf62933-e968-47c7-b707-fde4567a2ca2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00workspaceprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.shared_integration_datafactory_storage["curated"] will be created
  + resource "azurerm_role_assignment" "shared_integration_datafactory_storage" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5db1b6eb-6169-4d2f-84fb-fa18081d0a5c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00curatedprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.shared_integration_datafactory_storage["external"] will be created
  + resource "azurerm_role_assignment" "shared_integration_datafactory_storage" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5db1b6eb-6169-4d2f-84fb-fa18081d0a5c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00externalprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.shared_integration_datafactory_storage["landing"] will be created
  + resource "azurerm_role_assignment" "shared_integration_datafactory_storage" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5db1b6eb-6169-4d2f-84fb-fa18081d0a5c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00landingprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.shared_integration_datafactory_storage["raw"] will be created
  + resource "azurerm_role_assignment" "shared_integration_datafactory_storage" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5db1b6eb-6169-4d2f-84fb-fa18081d0a5c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00rawprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.shared_integration_datafactory_storage["workspace"] will be created
  + resource "azurerm_role_assignment" "shared_integration_datafactory_storage" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5db1b6eb-6169-4d2f-84fb-fa18081d0a5c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00workspaceprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.logic["00"].azurerm_resource_group_template_deployment.sqlConn will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "sqlConn" {
        id                       = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-logic-prod/providers/Microsoft.Resources/deployments/logicapp-sql-conn-deployment"
        name                     = "logicapp-sql-conn-deployment"
      ~ output_content           = jsonencode({}) -> (known after apply)
      ~ parameters_content       = jsonencode(
          ~ {
              - location   = {
                  - value = "uksouth"
                }
                # (1 unchanged attribute hidden)
            }
        )
        tags                     = {}
        # (5 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Compute/virtualMachines/ingest00-legacy-sql-prod"
        name                                                   = "ingest00-legacy-sql-prod"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_server.this will be updated in-place
  ~ resource "azurerm_mssql_server" "this" {
        id                                           = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-prod"
        name                                         = "ingest00-metadata-mssql-prod"
        tags                                         = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (13 unchanged attributes hidden)

      ~ azuread_administrator {
          ~ login_username              = "DTS Platform Operations SC" -> "DTS Owners (sub:dts-dataingest-prod)"
          ~ object_id                   = "4d0554dd-fe60-424a-be9c-36636826d927" -> "79bbfda1-998e-4e6a-afcd-c0a0021ddfc7"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this["ingest00landingprod"] will be created
  + resource "azurerm_data_factory_linked_service_azure_blob_storage" "this" {
      + data_factory_id          = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.DataFactory/factories/ingest00-runtimes-dataFactory001-prod"
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + name                     = "ingest00landingprod"
      + service_endpoint         = (sensitive value)
      + use_managed_identity     = true
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_data_factory_linked_service_key_vault.this["ingest00-meta002-prod"] will be created
  + resource "azurerm_data_factory_linked_service_key_vault" "this" {
      + data_factory_id          = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.DataFactory/factories/ingest00-runtimes-dataFactory001-prod"
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + key_vault_id             = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.KeyVault/vaults/ingest00-meta002-prod"
      + name                     = "ingest00-meta002-prod"
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this["keyvault"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.DataFactory/factories/ingest00-runtimes-dataFactory001-prod"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-runtimes-dataFactory001-keyvault-prod"
      + subresource_name   = "vault"
      + target_resource_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.KeyVault/vaults/ingest00-meta002-prod"

      + timeouts {
          + create = "60m"
        }
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this["landing-blob"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.DataFactory/factories/ingest00-runtimes-dataFactory001-prod"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-runtimes-dataFactory001-landing-blob-prod"
      + subresource_name   = "blob"
      + target_resource_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00landingprod"

      + timeouts {
          + create = "60m"
        }
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this["landing-dfs"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.DataFactory/factories/ingest00-runtimes-dataFactory001-prod"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-runtimes-dataFactory001-landing-dfs-prod"
      + subresource_name   = "dfs"
      + target_resource_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00landingprod"

      + timeouts {
          + create = "60m"
        }
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.null_resource.private_endpoint_approvals["keyvault"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.null_resource.private_endpoint_approvals["landing-blob"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.null_resource.private_endpoint_approvals["landing-dfs"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this["ingest00-meta002-prod"] will be created
  + resource "azurerm_data_factory_linked_service_key_vault" "this" {
      + data_factory_id          = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-prod"
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + key_vault_id             = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.KeyVault/vaults/ingest00-meta002-prod"
      + name                     = "ingest00-meta002-prod"
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["keyvault"] must be replaced
-/+ resource "azurerm_data_factory_managed_private_endpoint" "this" {
      ~ fqdns              = [
          - "ingest00-meta001-prod.vault.azure.net",
        ] -> (known after apply)
      ~ id                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-prod/managedVirtualNetworks/default/managedPrivateEndpoints/ingest00-integration-dataFactory001-keyvault-prod" -> (known after apply)
        name               = "ingest00-integration-dataFactory001-keyvault-prod"
      ~ target_resource_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.KeyVault/vaults/ingest00-meta001-prod" -> "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.KeyVault/vaults/ingest00-meta002-prod" # forces replacement
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["landing-blob"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-prod"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-landing-blob-prod"
      + subresource_name   = "blob"
      + target_resource_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00landingprod"

      + timeouts {
          + create = "60m"
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["landing-dfs"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-prod"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-landing-dfs-prod"
      + subresource_name   = "dfs"
      + target_resource_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00landingprod"

      + timeouts {
          + create = "60m"
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["keyvault"] will be replaced due to changes in replace_triggered_by
-/+ resource "null_resource" "private_endpoint_approvals" {
      ~ id = "6702441558948139109" -> (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["landing-blob"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["landing-dfs"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["mssql"] will be replaced due to changes in replace_triggered_by
-/+ resource "null_resource" "private_endpoint_approvals" {
      ~ id = "3680360612543117355" -> (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["storage-curated"] will be replaced due to changes in replace_triggered_by
-/+ resource "null_resource" "private_endpoint_approvals" {
      ~ id = "3986527839700860567" -> (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["storage-raw"] will be replaced due to changes in replace_triggered_by
-/+ resource "null_resource" "private_endpoint_approvals" {
      ~ id = "348720736914848209" -> (known after apply)
    }

  # module.data_landing_zone["00"].module.shir001.azurerm_virtual_machine_scale_set_extension.shir_install will be updated in-place
  ~ resource "azurerm_virtual_machine_scale_set_extension" "shir_install" {
        id                           = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Compute/virtualMachineScaleSets/ingest00-shir001-vmss-prod/extensions/ingest00-shir001-shir-install"
        name                         = "ingest00-shir001-shir-install"
      ~ settings                     = (sensitive value)
        # (9 unchanged attributes hidden)
    }

Plan: 30 to add, 4 to change, 7 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":40,"Program":"tfcmt","SHA1":"","Target":"prod_landing","Vars":{}} -->